Documents/ОплатаОтКлиента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ОплатаОтКлиента</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ВзаиморасчётыСКлиентами</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Акт</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.АктКлиенту</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ОплатаОтКлиента/Ext/ManagerModule.bsl
Функция СформироватьПечатнуюФорму(ДокументСсылка) Экспорт
	
	Макет = Документы.ОплатаОтКлиента.ПолучитьМакет("МакетОплаты");
	ТабДок = Новый ТабличныйДокумент;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОплатаОтКлиента.Номер КАК Номер,
	|	ОплатаОтКлиента.Дата КАК Дата,
	|	ОплатаОтКлиента.Сумма КАК Сумма,
	|	ОплатаОтКлиента.Акт.Номер КАК НомерАкта,
	|	ОплатаОтКлиента.Акт.Дата КАК ДатаАкта,
	|	ОплатаОтКлиента.Акт.Клиент КАК Клиент,
	|	ОплатаОтКлиента.Акт.Валюта КАК Валюта
	|ИЗ
	|	Документ.ОплатаОтКлиента КАК ОплатаОтКлиента
	|ГДЕ
	|	ОплатаОтКлиента.Ссылка = &Ссылка";
	
	Шапка = Запрос.Выполнить().Выбрать();
	Если Не Шапка.Следующий() Тогда
		Возврат ТабДок;
	КонецЕсли;
	
	Область = Макет.ПолучитьОбласть("Заголовок");
	Область.Параметры.Номер = Шапка.Номер;
	Область.Параметры.Дата = Формат(Шапка.Дата, "ДЛФ=D");
	Область.Параметры.Клиент = Шапка.Клиент;
	Область.Параметры.НомерАкта = Шапка.НомерАкта;
	Область.Параметры.ДатаАкта = Формат(Шапка.ДатаАкта, "ДЛФ=D");
	Область.Параметры.Сумма = Формат(Шапка.Сумма, "ЧДЦ=2");
	Область.Параметры.Валюта = Шапка.Валюта;
	ТабДок.Вывести(Область);
	ТабДок.Вывести(Макет.ПолучитьОбласть("Подвал"));
	
	Возврат ТабДок;
	
КонецФункции
